{
    "type": "Sequential",
    "structure": {
        "params": {},
        "layers": [
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "activation": "relu"
                },
                "inputs": {}
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "activation": "relu"
                },
                "inputs": {}
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "pool_size": [
                        2,
                        2
                    ]
                },
                "inputs": {}
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.25
                },
                "inputs": {}
            },
            {
                "class_name": "Flatten",
                "config": {},
                "inputs": {}
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 128,
                    "activation": "relu"
                },
                "inputs": {}
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.5
                },
                "inputs": {}
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 10,
                    "activation": "softmax"
                },
                "inputs": {}
            }
        ]
    }
}
