{
    "train_params": {},
    "input_params": {
        "shape": [
            28,
            28
        ]
    },
    "model_params": {
        "loss": "sparse_categorical_crossentropy",
        "optimizer": {
            "class_name": "adam",
            "config": {}
        },
        "metrics": [
            "accuracy"
        ]
    },
    "architecture": {
        "type": "Sequential",
        "layers": [
            {
                "class_name": "Flatten",
                "config": {}
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 128,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.2
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 10,
                    "activation": "softmax"
                }
            }
        ]
    }
}
