{
    "type": "Sequential",
    "structure": {
        "params": {
            "loss": "sparse_categorical_crossentropy",
            "optimizer": "adam",
            "metrics": [
                "accuracy"
            ]
        },
        "layers": [
            {
                "class_name": "Flatten",
                "config": {},
                "inputs": {}
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 128,
                    "activation": "relu"
                },
                "inputs": {}
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.2
                },
                "inputs": {}
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 10,
                    "activation": "softmax"
                },
                "inputs": {}
            }
        ]
    }
}
