{
    "dataset_params": {
        "class_name": "HDF5Reader",
        "config": {
            "filename": "../../mnist.h5",
            "batch_size": 128,
            "x_name": "x",
            "y_name": "y",
            "batch_cache": 100,
            "preprocessors": [
                {
                    "class_name": "SingleChannelPreprocessor",
                    "config": {}
                },
                {
                    "class_name": "KerasImagePreprocessorX",
                    "config": {
                        "scale_down": 255
                    }
                }
            ],
            "train_folds": [
                0,
                1
            ],
            "val_folds": [
                2
            ]
        }
    },
    "train_params": {
        "epochs": 12,
        "callbacks": [
            {
                "class_name": "CSVLogger",
                "config": {
                    "filename": "../../mnist_log.csv"
                }
            },
            {
                "class_name": "ModelCheckpoint",
                "config": {
                    "monitor": "val_loss",
                    "filepath": "../../mnist/mnist.{epoch:02d}-{val_loss:.2f}.h5",
                    "period": 1
                }
            }
        ]
    },
    "input_params": {
        "shape": [
            28,
            28,
            1
        ]
    },
    "model_params": {
        "loss": "sparse_categorical_crossentropy",
        "optimizer": {
            "class_name": "Adadelta"
        },
        "metrics": [
            "accuracy"
        ]
    },
    "architecture": {
        "type": "Sequential",
        "layers": [
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 32,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "MaxPooling2D"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.25
                }
            },
            {
                "class_name": "Flatten"
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 128,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.5
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 10,
                    "activation": "softmax"
                }
            }
        ]
    }
}
